lab5/orm/app/controllers/department_controller.rb

  def new
    department = Department.new({
      name:      params[:name],
      faculty_id: params[:faculty_id],
    })
    if department.save
---
INSERT INTO "departments" ("created_at", "faculty_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 21 May 2013 22:36:17 UTC +00:00], ["faculty_id", nil], ["name", nil], ["updated_at", Tue, 21 May 2013 22:36:17 UTC +00:00]]