lab5/orm/app/controllers/faculty_controller.rb

  def new
    faculty = Faculty.new({
      name:      params[:name],
    })
    if faculty.save
---
INSERT INTO "faculties" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 21 May 2013 22:36:21 UTC +00:00], ["name", nil], ["updated_at", Tue, 21 May 2013 22:36:21 UTC +00:00]]