lab5/orm/app/controllers/soap_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."id" = 1 LIMIT 1
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = 1 LIMIT 1
---
  def get_student
    student = Student.find(params[:id])
    render :soap => { :firstname => student.firstname,
                      :lastname => student.lastname,
                      :department => student.department.name,
                      :faculty => student.department.faculty.name