lab5/orm/app/controllers/student_controller.rb

  def new
    student = Student.new({
      firstname:      params[:firstname],
      lastname:       params[:lastname],
      department_id:  params[:department_id],
    })
    if student.save
---
INSERT INTO "students" ("created_at", "department_id", "firstname", "lastname", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 21 May 2013 22:35:59 UTC +00:00], ["department_id", nil], ["firstname", nil], ["lastname", nil], ["updated_at", Tue, 21 May 2013 22:35:59 UTC +00:00]]

  def search
    if params[:id] and params[:id] != ""
      @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", ""]]