lab5/orm/app/views/student/new.html.erb

	  <option value=""></option>
	  <% Department.all.each do |department| %>
---
SELECT "departments".* FROM "departments"