lab5/orm/app/views/department/new.html.erb

SELECT "faculties".* FROM "faculties"
---
	  <option value=""></option>
	  <% Faculty.all.each do |faculty| %>