lab4/app/controllers/apis_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def get_product
    product = Product.find(params[:id])